app/controllers/activities_controller.rb

INSERT INTO "activities" ("created_at", "date", "description", "duration", "id_cathegory", "id_creator", "id_location", "name", "privacy", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
   @activity  = Activity.new(activity_params)
      @activity.id_creator = current_user[:id]

      respond_to do |format|
      if @activity.save

SELECT "user_acts".* FROM "user_acts"
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 1]]
DELETE FROM "user_acts" WHERE "user_acts"."id" = ?  [["id", 1]]
---
  def destroy
    UserAct.all.each do |ua|
      if ua.id_activity == @activity.id
        ua.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    def set_user
        @user = User.find_by_id(@activity.id_creator)