app/views/activities/show.html.erb

<creator>by
  <%@user=User.find_by_id(@activity.id_creator) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  <strong>Location:</strong>
  <%@loc = Location.find_by_id(@activity.id_location)%>
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1

  <strong>Cathegory:</strong>
  <%@cat = Cathegory.find_by_id(@activity.id_cathegory)%>
---
SELECT "cathegories".* FROM "cathegories" WHERE "cathegories"."id" IS NULL LIMIT 1

    @target = nil
    @usacts = UserAct.all
---
SELECT "user_acts".* FROM "user_acts"